evencewu/Ecat_Firmware/stm32F4_ax58100_hw_no_pdi_irq/Lib/soes_hal_bsp/src/esc_irq.c
#include "esc_irq.h"
#include <stdint.h>
#include "stm32f4xx_conf.h"


void EXTILine0_Config(void)
{
    EXTI_InitTypeDef   EXTI_InitStructure;
    GPIO_InitTypeDef   GPIO_InitStructure;
    NVIC_InitTypeDef   NVIC_InitStructure;

    /* Enable GPIOA clock */
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
    /* Enable SYSCFG clock */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

    /* Configure PA0 pin as input floating */
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    /* Connect EXTI Line0 to PA0 pin */
    SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOA, EXTI_PinSource0);

    /* Configure EXTI Line0 */
    EXTI_InitStructure.EXTI_Line = EXTI_Line0;
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;  
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init(&EXTI_InitStructure);

    /* Enable and set EXTI Line0 Interrupt to the lowest priority */
    NVIC_InitStructure.NVIC_IRQChannel = EXTI0_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x01;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x01;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
}

void EXTILine0_Disable(void)
{
    EXTI_InitTypeDef   EXTI_InitStructure;
    NVIC_InitTypeDef   NVIC_InitStructure;

    /* Enable SYSCFG clock */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

    /* Configure EXTI Line1 */
    EXTI_InitStructure.EXTI_Line = EXTI_Line0;
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;  
    EXTI_InitStructure.EXTI_LineCmd = DISABLE;
    EXTI_Init(&EXTI_InitStructure);

    /* Enable and set EXTI Line1 Interrupt to the lowest priority */
    NVIC_InitStructure.NVIC_IRQChannel = EXTI0_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x01;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x01;
    NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
    NVIC_Init(&NVIC_InitStructure);
}

void EXTILine8_Config(void)
{
    //EXTI_InitTypeDef   EXTI_InitStructure;
    //GPIO_InitTypeDef   GPIO_InitStructure;
    //NVIC_InitTypeDef   NVIC_InitStructure;
//
    ///* Enable GPIOA clock */
    //RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
    ///* Enable SYSCFG clock */
    //RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
//
    ///* Configure PA8 pin as input floating */
    //GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
    //GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    //GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
    //GPIO_Init(GPIOA, &GPIO_InitStructure);
//
    ///* Connect EXTI Line5 to PA8 pin */
    //SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOA, EXTI_PinSource8);
//
    ///* Configure EXTI Line3 */
    //EXTI_InitStructure.EXTI_Line = EXTI_Line8;
    //EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    //EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;  
    //EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    //EXTI_Init(&EXTI_InitStructure);
//
    ////EXTI_ClearITPendingBit(EXTI_Line8);     //清除中断标志位
//
    ///* Enable and set EXTI Line3 Interrupt to the lowest priority */
    //NVIC_InitStructure.NVIC_IRQChannel = EXTI9_5_IRQn;
    //NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x01;
    //NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x01;
    //NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    //NVIC_Init(&NVIC_InitStructure);
}

void EXTILine8_Disable(void)
{

    //EXTI_InitTypeDef   EXTI_InitStructure;
    //NVIC_InitTypeDef   NVIC_InitStructure;
//
    ///* Enable SYSCFG clock */
    //RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
//
    ///* Configure EXTI Line3 */
    //EXTI_InitStructure.EXTI_Line = EXTI_Line8;
    //EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    //EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
    //EXTI_InitStructure.EXTI_LineCmd = DISABLE;
    //EXTI_Init(&EXTI_InitStructure);
//
    ////EXTI_ClearITPendingBit(EXTI_Line8);     //清除中断标志位
//
    ///* Enable and set EXTI Line3 Interrupt to the lowest priority */
    //NVIC_InitStructure.NVIC_IRQChannel = EXTI9_5_IRQn;
    //NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x01;
    //NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x01;
    //NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
    //NVIC_Init(&NVIC_InitStructure);
}
